##  Add/Remove Columns from Dataframe

In [26]:
import pandas as pd

In [27]:
people = {
    'first': ['Corey', 'Jane', 'John'],
    'last': ['Schafer', 'Doe', 'Doe'],
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@gmail.com', 'JohnDoe@gmail.com']
}

In [28]:
df = pd.DataFrame(people)
df.head()

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@gmail.com
2   John      Doe        JohnDoe@gmail.com

**Adding a new column by combining two columns**

In [29]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@gmail.com       Jane Doe
2   John      Doe        JohnDoe@gmail.com       John Doe

**Removing column(s)**

In [30]:
df.drop(columns=['first', 'last'], inplace=True)
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@gmail.com       Jane Doe
2        JohnDoe@gmail.com       John Doe

**Adding columns by splitting-up a column**

In [31]:
df['full_name'].str.split(' ')  # splitting-up 'full_name' column on SPACE

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [32]:
df['full_name'].str.split(' ', expand=True)  # assigning split-up column to two different columns

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [33]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)  # assigning split-up columns to df
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe

## Add/Remove Rows from Dataframe [using append]

**Adding a row**

In [34]:
df.append({'first': 'Tony'}, ignore_index=True)

C:\Users\tmsan\AppData\Local\Temp\ipykernel_13340\67547244.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first': 'Tony'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [35]:
df2 = pd.DataFrame({
    'first': ['Tony', 'Steve'],
    'last': ['Stark', 'Rogers'],
    'email': ['TonyStark@gmail.com', 'SteveRogers@gmail.com']
})

df2

   first    last                  email
0   Tony   Stark    TonyStark@gmail.com
1  Steve  Rogers  SteveRogers@gmail.com

**Adding a dataframe to another dataframe using *.append( )***

In [36]:
df.append(df2, ignore_index=True)

C:\Users\tmsan\AppData\Local\Temp\ipykernel_13340\26416246.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3      TonyStark@gmail.com            NaN   Tony    Stark
4    SteveRogers@gmail.com            NaN  Steve   Rogers

**Adding a dataframe to another dataframe using *.concat( )***

In [37]:
pd.concat([df, df2])

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
0      TonyStark@gmail.com            NaN   Tony    Stark
1    SteveRogers@gmail.com            NaN  Steve   Rogers

In [38]:
pd.concat([df, df2], ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3      TonyStark@gmail.com            NaN   Tony    Stark
4    SteveRogers@gmail.com            NaN  Steve   Rogers

In [39]:
df = pd.concat([df, df2], ignore_index=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3      TonyStark@gmail.com            NaN   Tony    Stark
4    SteveRogers@gmail.com            NaN  Steve   Rogers

**Removing a row.**

In [40]:
df.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@gmail.com       Jane Doe   Jane      Doe
2        JohnDoe@gmail.com       John Doe   John      Doe
3      TonyStark@gmail.com            NaN   Tony    Stark

**Removing rows based on filtering**

In [41]:
filt = df['last'] == 'Doe'
df.drop(index=df[filt].index)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3      TonyStark@gmail.com            NaN   Tony    Stark
4    SteveRogers@gmail.com            NaN  Steve   Rogers